/*
問題描述 ：

輸入所使用的度數，換算夏月及非夏月之電費金額

每度（元）

夏月

非夏月

120 度以下部分

2.10

2.10

121-330 度部分

3.02

2.68

331-500 度部分

4.39

3.61

501-700 度部分

4.97

4.01

701 度以上部分

5.63

4.50

輸入說明 ：

一個度數 ( 正整數 )

輸出說明 ：

夏月與非夏月的金額，請輸出至小數點後兩位

*/

#include <iostream>
#include <iomanip>
using namespace std;
int main()
{

    int k;
    cin >> k;
    if (k <= 120)
    {
        k = k * 2.10;
    }
    else if (k >= 121 && k <= 330)
    {
        k = 252 + k * 3.02;
    }
    else if (k >= 331 && k <= 500)
    {
        k = 252 + 631.18 + (k * 4.39);
    }
    else if (k >= 501 && k <= 700)
    {
        k = 252 + 631.18 + 741.91 + (k * 4.07);
    }
    else if (k >= 701)
    {
        k = 252 + 631.18 + 741.91 + (k * 5.63);
    }
    cout << fixed << setprecision(2) << (double)k << endl;
}